analogdevicesinc/EVAL-ADICUP3029/projects/ADuCM3029_ArrowConnect_Greenhouse/src/wolfSSL/wolfcrypt/src/random.c
const byte outputB[] = {
    0xd3, 0xe1, 0x60, 0xc3, 0x5b, 0x99, 0xf3, 0x40, 0xb2, 0x62, 0x82, 0x64,
    0xd1, 0x75, 0x10, 0x60, 0xe0, 0x04, 0x5d, 0xa3, 0x83, 0xff, 0x57, 0xa5,
    0x7d, 0x73, 0xa6, 0x73, 0xd2, 0xb8, 0xd8, 0x0d, 0xaa, 0xf6, 0xa6, 0xc3,
    0x5a, 0x91, 0xbb, 0x45, 0x79, 0xd7, 0x3f, 0xd0, 0xc8, 0xfe, 0xd1, 0x11,
    0xb0, 0x39, 0x13, 0x06, 0x82, 0x8a, 0xdf, 0xed, 0x52, 0x8f, 0x01, 0x81,
    0x21, 0xb3, 0xfe, 0xbd, 0xc3, 0x43, 0xe7, 0x97, 0xb8, 0x7d, 0xbb, 0x63,
    0xdb, 0x13, 0x33, 0xde, 0xd9, 0xd1, 0xec, 0xe1, 0x77, 0xcf, 0xa6, 0xb7,
    0x1f, 0xe8, 0xab, 0x1d, 0xa4, 0x66, 0x24, 0xed, 0x64, 0x15, 0xe5, 0x1c,
    0xcd, 0xe2, 0xc7, 0xca, 0x86, 0xe2, 0x83, 0x99, 0x0e, 0xea, 0xeb, 0x91,
    0x12, 0x04, 0x15, 0x52, 0x8b, 0x22, 0x95, 0x91, 0x02, 0x81, 0xb0, 0x2d,
    0xd4, 0x31, 0xf4, 0xc9, 0xf7, 0x04, 0x27, 0xdf
};


static int wc_RNG_HealthTestLocal(int reseed)
{
    int ret = 0;
    byte check[SHA256_DIGEST_SIZE * 4];

    if (reseed) {
        ret = wc_RNG_HealthTest(1, entropyA, sizeof(entropyA),
                                reseedEntropyA, sizeof(reseedEntropyA),
                                check, sizeof(check));
        if (ret == 0) {
            if (ConstantCompare(check, outputA, sizeof(check)) != 0)
                ret = -1;
        }
    }
    else {
        ret = wc_RNG_HealthTest(0, entropyB, sizeof(entropyB),
                                NULL, 0,
                                check, sizeof(check));
        if (ret == 0) {
            if (ConstantCompare(check, outputB, sizeof(check)) != 0)
                ret = -1;
        }
    }

    return ret;
}


#else /* HAVE_HASHDRBG || NO_RC4 */

/* Get seed and key cipher */
int wc_InitRng(WC_RNG* rng)
{
    int  ret;
#ifdef WOLFSSL_SMALL_STACK
    byte* key;
    byte* junk;
#else
    byte key[32];
    byte junk[256];
#endif

#ifdef HAVE_INTEL_RDGEN
    wc_InitRng_IntelRD() ;
    if(IS_INTEL_RDRAND)return 0 ;
#endif
#ifdef HAVE_CAVIUM
    if (rng->magic == WOLFSSL_RNG_CAVIUM_MAGIC)
        return 0;
#endif

#ifdef WOLFSSL_SMALL_STACK
    key = (byte*)XMALLOC(32, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    if (key == NULL)
        return MEMORY_E;

    junk = (byte*)XMALLOC(256, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    if (junk == NULL) {
        XFREE(key, NULL, DYNAMIC_TYPE_TMP_BUFFER);
        return MEMORY_E;
    }
#endif

    ret = wc_GenerateSeed(&rng->seed, key, 32);

    if (ret == 0) {
        wc_Arc4SetKey(&rng->cipher, key, sizeof(key));

        ret = wc_RNG_GenerateBlock(rng, junk, 256); /*rid initial state*/
    }

#ifdef WOLFSSL_SMALL_STACK
    XFREE(key, NULL, DYNAMIC_TYPE_TMP_BUFFER);
    XFREE(junk, NULL, DYNAMIC_TYPE_TMP_BUFFER);
#endif

    return ret;
}

#ifdef HAVE_CAVIUM
    static void CaviumRNG_GenerateBlock(WC_RNG* rng, byte* output, word32 sz);
#endif

/* place a generated block in output */
int wc_RNG_GenerateBlock(WC_RNG* rng, byte* output, word32 sz)
{
#ifdef HAVE_INTEL_RDGEN
    if(IS_INTEL_RDRAND)
        return wc_GenerateRand_IntelRD(NULL, output, sz) ;
#endif
#ifdef HAVE_CAVIUM
    if (rng->magic == WOLFSSL_RNG_CAVIUM_MAGIC)
        return CaviumRNG_GenerateBlock(rng, output, sz);
#endif
    XMEMSET(output, 0, sz);
    wc_Arc4Process(&rng->cipher, output, output, sz);

    return 0;
}


int wc_RNG_GenerateByte(WC_RNG* rng, byte* b)
{
    return wc_RNG_GenerateBlock(rng, b, 1);
}


int wc_FreeRng(WC_RNG* rng)
{
    (void)rng;
    return 0;
}


#ifdef HAVE_CAVIUM

#include <wolfssl/ctaocrypt/logging.h>
#include "cavium_common.h"

/* Initialize RNG for use with Nitrox device */
int wc_InitRngCavium(WC_RNG* rng, int devId)
{
    if (rng == NULL)
        return -1;

    rng->devId = devId;
    rng->magic = WOLFSSL_RNG_CAVIUM_MAGIC;

    return 0;
}


static void CaviumRNG_GenerateBlock(WC_RNG* rng, byte* output, word32 sz)
{
    wolfssl_word offset = 0;
    word32      requestId;

    while (sz > WOLFSSL_MAX_16BIT) {
        word16 slen = (word16)WOLFSSL_MAX_16BIT;
        if (CspRandom(CAVIUM_BLOCKING, slen, output + offset, &requestId,
                      rng->devId) != 0) {
            WOLFSSL_MSG("Cavium RNG failed");
        }
        sz     -= WOLFSSL_MAX_16BIT;
        offset += WOLFSSL_MAX_16BIT;
    }
    if (sz) {
        word16 slen = (word16)sz;
        if (CspRandom(CAVIUM_BLOCKING, slen, output + offset, &requestId,
                      rng->devId) != 0) {
            WOLFSSL_MSG("Cavium RNG failed");
        }
    }
}

#endif /* HAVE_CAVIUM */

#endif /* HAVE_HASHDRBG || NO_RC4 */


#if defined(HAVE_INTEL_RDGEN)

#ifndef _MSC_VER
    #define cpuid(reg, leaf, sub)\
            __asm__ __volatile__ ("cpuid":\
             "=a" (reg[0]), "=b" (reg[1]), "=c" (reg[2]), "=d" (reg[3]) :\
             "a" (leaf), "c"(sub));

    #define XASM_LINK(f) asm(f)
#else

    #include <intrin.h>
    #define cpuid(a,b) __cpuid((int*)a,b)

    #define XASM_LINK(f)

#endif /* _MSC_VER */

#define EAX 0
#define EBX 1
#define ECX 2
#define EDX 3

static word32 cpuid_flag(word32 leaf, word32 sub, word32 num, word32 bit) {
    int got_intel_cpu=0;
    unsigned int reg[5];

    reg[4] = '\0' ;
    cpuid(reg, 0, 0);
    if(memcmp((char *)&(reg[EBX]), "Genu", 4) == 0 &&
                memcmp((char *)&(reg[EDX]), "ineI", 4) == 0 &&
                memcmp((char *)&(reg[ECX]), "ntel", 4) == 0) {
        got_intel_cpu = 1;
    }
    if (got_intel_cpu) {
        cpuid(reg, leaf, sub);
        return((reg[num]>>bit)&0x1) ;
    }
    return 0 ;
}

static int wc_InitRng_IntelRD()
{
    if(cpuid_check==0) {
        if(cpuid_flag(1, 0, ECX, 30)){ cpuid_flags |= CPUID_RDRAND ;}
        if(cpuid_flag(7, 0, EBX, 18)){ cpuid_flags |= CPUID_RDSEED ;}
        cpuid_check = 1 ;
    }
    return 1 ;
}

#define INTELRD_RETRY 10

#if defined(HAVE_HASHDRBG) || defined(NO_RC4)

/* return 0 on success */
static INLINE int IntelRDseed32(unsigned int *seed)
{
    int rdseed;  unsigned char ok ;

    __asm__ volatile("rdseed %0; setc %1":"=r"(rdseed), "=qm"(ok));
    if(ok){
        *seed = rdseed ;
        return 0 ;
    } else
        return 1;
}

/* return 0 on success */
static INLINE int IntelRDseed32_r(unsigned int *rnd)
{
    int i ;
    for(i=0; i<INTELRD_RETRY;i++) {
       if(IntelRDseed32(rnd) == 0) return 0 ;
    }
    return 1 ;
}

/* return 0 on success */
static int wc_GenerateSeed_IntelRD(OS_Seed* os, byte* output, word32 sz)
{
    (void) os ;
    int ret ;
    unsigned int rndTmp ;

    for(  ; sz/4 > 0; sz-=4, output+=4) {
        if(IS_INTEL_RDSEED)ret = IntelRDseed32_r((word32 *)output) ;
        else return 1 ;
        if(ret)
             return 1 ;
    }
    if(sz == 0)return 0 ;

    if(IS_INTEL_RDSEED)ret = IntelRDseed32_r(&rndTmp) ;
    else return 1 ;
    if(ret)
         return 1 ;
    XMEMCPY(output, &rndTmp, sz) ;
    return 0;
}

#else

/* return 0 on success */
static INLINE int IntelRDrand32(unsigned int *rnd)
{
    int rdrand; unsigned char ok ;
    __asm__ volatile("rdrand %0; setc %1":"=r"(rdrand), "=qm"(ok));
    if(ok){
        *rnd = rdrand;
        return 0 ;
    } else
        return 1;
}

/* return 0 on success */
static INLINE int IntelRDrand32_r(unsigned int *rnd)
{
    int i ;
    for(i=0; i<INTELRD_RETRY;i++) {
       if(IntelRDrand32(rnd) == 0) return 0 ;
    }
    return 1 ;
}

/* return 0 on success */
static int wc_GenerateRand_IntelRD(OS_Seed* os, byte* output, word32 sz)
{
    (void) os ;
    int ret ;
    unsigned int rndTmp;

    for(  ; sz/4 > 0; sz-=4, output+=4) {
        if(IS_INTEL_RDRAND)ret = IntelRDrand32_r((word32 *)output);
        else return 1 ;
        if(ret)
             return 1 ;
    }
    if(sz == 0)return 0 ;

    if(IS_INTEL_RDRAND)ret = IntelRDrand32_r(&rndTmp);
    else return 1 ;
    if(ret)
         return 1 ;
    XMEMCPY(output, &rndTmp, sz) ;
    return 0;
}
#endif /* defined(HAVE_HASHDRBG) || defined(NO_RC4) */

#endif /* HAVE_INTEL_RDGEN */


/* wc_GenerateSeed Implementations */
#if defined(CUSTOM_RAND_GENERATE_SEED)

    /* Implement your own random generation function
     * Return 0 to indicate success
     * int rand_gen_seed(byte* output, word32 sz);
     * #define CUSTOM_RAND_GENERATE_SEED  rand_gen_seed */

    int wc_GenerateSeed(OS_Seed* os, byte* output, word32 sz)
    {
        (void)os; /* Suppress unused arg warning */
        return CUSTOM_RAND_GENERATE_SEED(output, sz);
    }

#elif defined(CUSTOM_RAND_GENERATE_SEED_OS)

